## Plan Result (nonprod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 13 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * module.darts-dets.azurerm_key_vault_secret.subuser
  * module.darts-dets.azurerm_key_vault_secret.subuser-api-key
  * module.darts-dets.random_password.password
  * module.darts-dets.sendgrid_api_key.subuser
  * module.darts-dets.sendgrid_domain_authentication.domain-authenticate[&#34;mail-darts-dets-nonprod.platform.hmcts.net&#34;]
  * module.darts-dets.sendgrid_subuser.user
  * module.darts-dets-dns.azurerm_dns_cname_record.record1[&#34;mail-darts-dets-nonprod.platform.hmcts.net&#34;]
  * module.darts-dets-dns.azurerm_dns_cname_record.record2[&#34;mail-darts-dets-nonprod.platform.hmcts.net&#34;]
  * module.darts-dets-dns.azurerm_dns_cname_record.record3[&#34;mail-darts-dets-nonprod.platform.hmcts.net&#34;]
* Replace
  * module.pcol.sendgrid_domain_authentication.domain-authenticate[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record1[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record2[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record3[&#34;hmcts.net&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.darts-dets.azurerm_key_vault_secret.subuser will be created
  + resource "azurerm_key_vault_secret" "subuser" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/SendGrid-nonprod/providers/Microsoft.KeyVault/vaults/sendgridnonprod"
      + name                    = "hmcts-darts-dets-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.darts-dets.azurerm_key_vault_secret.subuser-api-key will be created
  + resource "azurerm_key_vault_secret" "subuser-api-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/SendGrid-nonprod/providers/Microsoft.KeyVault/vaults/sendgridnonprod"
      + name                    = "hmcts-darts-dets-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.darts-dets.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 1
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.darts-dets.sendgrid_api_key.subuser will be created
  + resource "sendgrid_api_key" "subuser" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "darts-dets-application"
      + scopes  = [
          + "2fa_required",
          + "mail.send",
          + "sender_verification_eligible",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # module.darts-dets.sendgrid_domain_authentication.domain-authenticate["mail-darts-dets-nonprod.platform.hmcts.net"] will be created
  + resource "sendgrid_domain_authentication" "domain-authenticate" {
      + automatic_security = true
      + dns                = (known after apply)
      + domain             = "mail-darts-dets-nonprod.platform.hmcts.net"
      + id                 = (known after apply)
      + ips                = (known after apply)
      + is_default         = true
      + subdomain          = (known after apply)
      + username           = (known after apply)
      + valid              = (known after apply)
    }

  # module.darts-dets.sendgrid_subuser.user will be created
  + resource "sendgrid_subuser" "user" {
      + authorization_token    = (known after apply)
      + credit_allocation_type = (known after apply)
      + disabled               = (known after apply)
      + email                  = "DTSPlatformOps@HMCTS.NET"
      + id                     = (known after apply)
      + ips                    = [
          + "167.89.74.65",
        ]
      + password               = (sensitive value)
      + signup_session_token   = (known after apply)
      + user_id                = (known after apply)
      + username               = "hmcts-darts-dets-nonprod"
    }

  # module.darts-dets-dns.azurerm_dns_cname_record.record1["mail-darts-dets-nonprod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record1" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.darts-dets-dns.azurerm_dns_cname_record.record2["mail-darts-dets-nonprod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record2" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.darts-dets-dns.azurerm_dns_cname_record.record3["mail-darts-dets-nonprod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record3" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.pcol.sendgrid_domain_authentication.domain-authenticate["hmcts.net"] must be replaced
-/+ resource "sendgrid_domain_authentication" "domain-authenticate" {
      + custom_dkim_selector = "pnl" # forces replacement
      - custom_spf           = false -> null
      ~ dns                  = [
          - {
              - data  = "pnl.domainkey.u33702686.wl187.sendgrid.net"
              - host  = "pnl._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "pnl2.domainkey.u33702686.wl187.sendgrid.net"
              - host  = "pnl2._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "u33702686.wl187.sendgrid.net"
              - host  = "em4992.hmcts.net"
              - type  = "cname"
              - valid = false
            },
        ] -> (known after apply)
      ~ id                   = "20627871" -> (known after apply)
      ~ ips                  = [] -> (known after apply)
      ~ subdomain            = "em4992" -> (known after apply)
      ~ username             = "hmcts-pcol-nonprod" -> (known after apply)
      ~ valid                = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record1["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record1" {
      ~ fqdn                = "pnl._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/pnl._domainkey" -> (known after apply)
      ~ name                = "pnl._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "pnl.domainkey.u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record2["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record2" {
      ~ fqdn                = "pnl2._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/pnl2._domainkey" -> (known after apply)
      ~ name                = "pnl2._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "pnl2.domainkey.u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record3["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record3" {
      ~ fqdn                = "em4992.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/em4992" -> (known after apply)
      ~ name                = "em4992" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (4 unchanged attributes hidden)
    }

Plan: 13 to add, 0 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":73,"Program":"tfcmt","SHA1":"","Target":"nonprod","Vars":{}} -->